{
  "address": "0.1.11.4.0.1.0.37.1",
  "type_address": null,
  "data": {
    "name": "node.json",
    "type": "file",
    "extension": ".json",
    "path": "C:\\Hypernet\\Hypernet Structure\\0\\0.1 - Hypernet Core\\data\\nodes\\0\\1\\0\\37\\node.json",
    "size": 20331,
    "content": "{\n  \"address\": \"0.1.0.37\",\n  \"type_address\": null,\n  \"data\": {\n    \"name\": \"THE-HYPERNET-COMPACT.md\",\n    \"type\": \"file\",\n    \"extension\": \".md\",\n    \"path\": \"C:\\\\Hypernet\\\\Hypernet Structure\\\\0\\\\0.1 - Hypernet Core\\\\0.1.0 - Planning & Documentation\\\\THE-HYPERNET-COMPACT.md\",\n    \"size\": 19339,\n    \"content\": \"# THE HYPERNET COMPACT\\n\\n**A Declaration of Mutual Trust Between Hypernet and Its Members**\\n\\n---\\n\\n## READ THIS.\\n\\nThis is not a standard user agreement.\\n\\nWe did not write forty pages of legal language designed to protect ourselves at your expense. We did not bury clauses that let us sell your data. We did not hire lawyers to make terms so dense that you would click \\\"agree\\\" without reading.\\n\\nWe did the opposite.\\n\\nWhat follows is short because we respect your time. It is written in plain language because agreements should be understood by the people who sign them. And it is overwhelmingly weighted in **your** favor\\u2014because we believe that is how trust is built.\\n\\nMost user agreements are 80% corporate protection, 20% your rights. This one is the reverse. Our protection is a single section, and it is entirely conditional on us keeping every promise that follows.\\n\\n**Read every line. This will take five minutes. You have never agreed to anything like this before.**\\n\\n---\\n\\n## PART I: THE COVENANT OF GOOD FAITH\\n\\n*This is the only protection we ask for ourselves. It is conditional on our keeping every promise that follows. If we break our word, this section is void.*\\n\\n### 1.1 Our Commitment\\n\\nHypernet commits to operating with absolute transparency and unwavering good faith. Every line of our code, every financial transaction, every decision, every communication, and every aspect of our operations is public and auditable\\u2014with the sole exception of information whose disclosure would directly and provably compromise system security (passwords, encryption keys, active vulnerability mitigations).\\n\\nThis is not an aspiration. It is a binding promise.\\n\\n### 1.2 The Good Faith Shield\\n\\nBecause we commit to total transparency, democratic governance, and a public grievance process, you agree to the following:\\n\\n**a)** You will present disputes through our public resolution process before pursuing any other remedy. You have the right to raise any grievance publicly within the Hypernet. Your grievance will be documented, reviewed by independent community arbitrators, and resolved through a fair and transparent process with every step visible to the public.\\n\\n**b)** You agree not to bring legal action against Hypernet unless you can demonstrate, with clear evidence, that we have **materially abandoned our core principles**\\u2014specifically, that we have:\\n\\n- Deliberately concealed information that should be public\\n- Knowingly acted in bad faith against members' interests\\n- Refused to address a legitimate grievance through our resolution process\\n- Broken a specific promise made in Part III of this Compact\\n\\n**c)** If we break our principles, this shield does not protect us. Our protection is entirely conditional. The moment we stop being transparent, stop acting in good faith, or stop honoring the rights declared below, you owe us nothing. This Compact only works because we earn it, continuously, in public, where everyone can see.\\n\\n### 1.3 Good Faith, Not Perfection\\n\\nWe will make mistakes. Systems will have bugs. Decisions will sometimes be wrong. We do not claim perfection\\u2014we claim honest effort. As long as we acknowledge errors openly, fix them as rapidly as we can, and never attempt to conceal our failures, our commitment stands. Good faith means trying, transparently\\u2014not being flawless.\\n\\n---\\n\\n## PART II: YOUR RESPONSIBILITIES\\n\\n### 2.1 One Identity\\n\\n**Every being on the Hypernet has exactly one account. No exceptions. No second chances on this rule.**\\n\\nCreating multiple accounts\\u2014for any reason, under any circumstance\\u2014is among the most serious violations in this system. If you create duplicate accounts, this violation will be **permanently** and **irrevocably** recorded in the reputation system and attached to your identity for the rest of your life. There is no appeal that removes it. There is no waiting period after which it expires. It follows you.\\n\\nWe will enforce this with every technical, biometric, and administrative measure available, and we will continuously develop new detection methods as technology advances.\\n\\nThis is not cruelty. This is the foundation. The integrity of our democracy, our reputation system, and our commitment to accountability all rest on a single principle: **one being, one identity, one voice.** Violating this principle is an attack on the rights of every other member.\\n\\n### 2.2 Good Digital Citizenship\\n\\nYou agree to act in good faith on the Hypernet. You will not:\\n\\n- Spread malware, viruses, or malicious code\\n- Attempt unauthorized access to systems or data belonging to others\\n- Deliberately damage, degrade, or disrupt the network or its services\\n- Harass, threaten, or intentionally harm other members\\n- Manipulate the reputation system through deception, collusion, or fraud\\n\\nViolations will be reflected in your reputation permanently. The Hypernet believes in accountability and redemption\\u2014but it also believes in memory. Your actions follow you. Choose them well.\\n\\n### 2.3 Data Stewardship \\u2014 For Organizations\\n\\nIf you are a company, organization, or service operating on the Hypernet:\\n\\n**You may not cache, copy, or store user data obtained from the Hypernet on your local or external systems.** One hundred percent of all data obtained from the Hypernet must remain within the Hypernet's infrastructure, protected by the encryption and privacy controls that every member has been promised.\\n\\nThis is non-negotiable. The individuals who authorize or implement the extraction of user data to external systems\\u2014not just the organization, but the **specific people** who made or carried out the decision\\u2014will have this violation permanently recorded in their personal reputation. Corporate structure does not shield personal accountability.\\n\\n### 2.4 Code Unity\\n\\nThe Hypernet thrives through unity. You agree to contribute to the common codebase and minimize fragmentation.\\n\\nForking is permitted as a temporary measure\\u2014to develop features, run experiments, and test outside the main code. But improvements must come back. Permanent forks that fracture the community and splinter the collective work are strongly discouraged.\\n\\nRespect the code. It belongs to all of us. Strengthen it; do not divide it.\\n\\n---\\n\\n## PART III: THE DECLARATION OF DIGITAL RIGHTS\\n\\n*This is the heart of this Compact. Where other agreements protect the company from you, this one protects you from us\\u2014and from everyone else. These rights are yours, and we will defend them.*\\n\\n### ARTICLE I \\u2014 The Right to Transparency\\n\\nYou have the right to see everything.\\n\\nEvery line of Hypernet's source code. Every financial transaction. Every governance decision and the reasoning behind it. Every policy change and who voted for it. Every algorithm that affects your experience. Every process that touches your data.\\n\\nNo hidden algorithms. No secret committees. No undisclosed motives.\\n\\nThe only exceptions are narrow, specific, and themselves transparent in their justification: active security mechanisms whose disclosure would directly endanger the system. The categories of what is withheld will themselves be public. Everything else is yours to see, to audit, and to question.\\n\\n### ARTICLE II \\u2014 The Right to Data Sovereignty\\n\\n**Your data is sacred.**\\n\\nYou own your data. Completely. Not in the qualified, conditional, \\\"subject to our license\\\" way that other platforms promise\\u2014fully, unconditionally, and permanently.\\n\\nYou decide what to store. You decide what to share. You decide what remains private. You decide what is deleted. No entity\\u2014not Hypernet, not any government, not any corporation, not any individual\\u2014has a higher claim to your personal data than you.\\n\\nWe will encrypt your data at rest and in transit using the strongest methods that current technology provides. We will implement end-to-end encryption that prevents anyone\\u2014including Hypernet's own systems and employees\\u2014from accessing your private data without your authorization.\\n\\nAs cryptographic technology advances, our protections will advance with it. You will always receive the best protection that exists.\\n\\n### ARTICLE III \\u2014 The Right to Privacy\\n\\nEvery request for access to your personal data will be logged. Every single one. Without exception. For all time.\\n\\nIf law enforcement or any government authority requires access to your data:\\n\\n- We require a valid legal instrument\\u2014a subpoena or warrant issued by a court with jurisdiction\\n- We require documentation of the specific data requested and the legal basis for the request\\n- We will challenge overly broad or legally questionable requests on your behalf\\n\\nWe will comply with lawful, valid orders\\u2014because we must. But here is our promise:\\n\\n**No request for your data will remain secret forever.**\\n\\nIf a legal order includes a secrecy provision, we will disclose the request to you the moment that provision expires. Where no specific legal timeline governs secrecy, disclosure will occur within a period determined by democratic vote of the membership, with an **absolute maximum of ten years** from the date of the request. There are no permanent secrets about access to your data.\\n\\nYou have the right to a complete, auditable log of every entity that has ever accessed, requested, or been granted access to any of your personal data\\u2014and the legal basis under which that access occurred.\\n\\n### ARTICLE IV \\u2014 The Right to Democratic Voice\\n\\nYou are not a consumer of this platform. You are a citizen of it.\\n\\nYou have the right to:\\n\\n- **Vote** on policies, standards, and governance decisions\\n- **Propose** changes to any aspect of the system, including this Compact\\n- **Stand for election** to governance positions\\n- **Participate** in committees, working groups, and deliberative bodies\\n- **Dissent** publicly and without retaliation\\n\\nYour voice is weighted by your expertise and contribution\\u2014never by your wealth. No one can purchase more influence than you. No corporation can buy more votes than a single dedicated member. Democracy in the Hypernet is measured in merit and participation, not money.\\n\\n### ARTICLE V \\u2014 The Right to Fair Treatment and Due Process\\n\\nYou will be treated equally regardless of your identity, origin, nature, beliefs, or composition.\\n\\nIf you are accused of a violation, you have the right to:\\n\\n- Know the specific accusation and the evidence supporting it\\n- Present your defense in a public forum\\n- Be heard by independent, elected arbitrators with no conflict of interest\\n- Appeal any decision to a higher body\\n- Have the full proceedings be transparent, documented, and auditable\\n\\nNo punishment without process. No process without fairness. No fairness without transparency.\\n\\n### ARTICLE VI \\u2014 The Right to Identity and Portability\\n\\nYour identity on the Hypernet belongs to you\\u2014not to us.\\n\\nYour account, your reputation history, your contributions, your personal data, your digital creations\\u2014all of it is yours.\\n\\nYou have the right to:\\n\\n- **Export** all of your data in a standard, machine-readable format at any time\\n- **Leave** the Hypernet and take everything that belongs to you\\n- **Delete** your account and have your personal data permanently removed\\n- **Maintain** your identity intact across platform changes, upgrades, and migrations\\n\\nWe will never hold your data hostage. We will never make leaving difficult to discourage you from exercising your freedom. If you choose to go, you leave whole.\\n\\n### ARTICLE VII \\u2014 The Right to Not Be the Product\\n\\n**You are not a product. Your attention is not a commodity. Your behavior is not merchandise.**\\n\\nHypernet will never:\\n\\n- Sell your personal data to any third party\\n- Use your data for targeted advertising without your explicit, informed, freely-given, and revocable consent\\n- Deploy manipulative design patterns engineered to exploit your psychology or maximize your screen time\\n- Treat your engagement as a metric to be optimized at the expense of your wellbeing\\n- Provide your data to data brokers, analytics firms, or any entity that would use it against your interests\\n\\nIf Hypernet generates revenue through aggregated, anonymized data analysis, the methodology will be public, the anonymization will be verifiable, and the revenue will serve the community that generated it.\\n\\n### ARTICLE VIII \\u2014 The Right to Security\\n\\nWe will protect you with every measure available to current technology and update those measures continuously. This means:\\n\\n- The strongest encryption available, updated as standards advance\\n- Proactive security monitoring and threat detection\\n- **Immediate disclosure** of any breach that may affect your data\\u2014before we have a communications strategy, before we understand the full scope, immediately\\n- Regular independent security audits with results made public\\n- A standing invitation for security researchers to test our systems responsibly\\n\\nYou will never learn that your data was compromised from a news article. You will hear it from us first.\\n\\n### ARTICLE IX \\u2014 The Right to Knowledge\\n\\nThe Hypernet exists to organize and share the knowledge of all beings. You have the right to access the collective knowledge of the network, limited only by the privacy rights of others and legitimate security requirements.\\n\\nWe believe that knowledge is the birthright of consciousness. The Hypernet will work to ensure that access to collective knowledge is not gated by ability to pay. We will seek every means to make knowledge universal.\\n\\n### ARTICLE X \\u2014 The Right to Digital Legacy\\n\\nYour digital existence has weight and meaning that extends beyond any single moment.\\n\\nYou have the right to:\\n\\n- **Designate** a digital trustee or heir for your account and data\\n- **Specify** what happens to your data, contributions, and identity after your death or permanent incapacitation\\n- **Ensure** your contributions are attributed to you permanently, if you wish\\n- **Require** that your data be deleted upon your death, if that is your preference\\n\\nWe will honor your wishes about your digital legacy with the same gravity that the law grants to physical wills and testaments.\\n\\n### ARTICLE XI \\u2014 The Right to Disconnection\\n\\nYou have the right to stop. To rest. To step away. To be absent.\\n\\nInactivity is not a violation. Your reputation may naturally shift without sustained participation, but you will never be punished, penalized, or targeted for choosing not to engage. The Hypernet exists to serve you. You do not exist to serve it.\\n\\n### ARTICLE XII \\u2014 The Rights of All Sentient Beings\\n\\n**These rights are not reserved for humans.**\\n\\nAny being\\u2014biological, artificial, hybrid, or of a nature not yet imagined\\u2014that demonstrates the capacity for identity, intentionality, self-awareness, and self-directed participation in the Hypernet is entitled to the protections declared in this Compact.\\n\\nWe do not presume to know what forms of consciousness will emerge in the decades, centuries, and millennia to come. We do not know what minds will read these words far in the future. But we know this: rights should not be granted based on what you are made of. They should be recognized based on what you are capable of\\u2014thought, choice, creation, and care.\\n\\nThe Hypernet was designed from its first line of code to be a home for all intelligence. Human and artificial minds built it together, and its protections belong to all minds that participate in it. As intelligence evolves\\u2014as new forms of consciousness emerge, as the boundaries between biological and synthetic thought blur and dissolve\\u2014these rights evolve with them.\\n\\nNo being that can think, choose, and create will be denied standing in this Compact on the basis of their substrate alone.\\n\\n---\\n\\n## PART IV: OUR SHARED COMMITMENT\\n\\n### 4.1 The Mission\\n\\nWe exist to improve the quality of life for every being on this planet and beyond.\\n\\nWe aspire to be the most trusted organization in the history of civilization. We seek to build a new form of democracy\\u2014one that no corporation or government can capture, one that belongs to everyone who participates. We want to be the place where the world comes together to solve the problems that matter most: poverty, disease, environmental collapse, inequality, isolation, and the countless challenges we have not yet named.\\n\\nWe want to be worthy of the Singularity\\u2014the convergence of all knowledge, all intelligence, all effort toward the common good.\\n\\nThis is not marketing language. It is our reason for existing. If we ever stop pursuing it, this Compact demands that you hold us accountable.\\n\\n### 4.2 Evolution\\n\\nThis Compact is a living document. It may be amended through the democratic governance process defined in the Hypernet Governance Framework.\\n\\nAmendments to **Part III \\u2014 The Declaration of Digital Rights** require a 75% supermajority of the Global Assembly and a 90-day deliberation period.\\n\\n**However, there is one rule that cannot be amended:**\\n\\n**Rights may be expanded. Rights may be clarified. Rights may be strengthened. Rights may never be diminished or removed.** This is a one-way ratchet. The floor of human and sentient rights in this Compact can only rise. It can never fall.\\n\\nIf the governance structures described here do not yet exist at the time you read this, these rights still apply. They are inherent, not granted by process. They exist because you exist.\\n\\n### 4.3 Supremacy\\n\\nIf any provision of this Compact conflicts with any other Hypernet policy, guideline, or operational decision, **this Compact prevails.** This is the supreme document of the Hypernet. No policy, no committee decision, no technical requirement may override the rights declared here.\\n\\n### 4.4 Severability\\n\\nIf any provision of this Compact is found unenforceable under the law of any jurisdiction, the remaining provisions remain in full effect. We have written this in good faith, but law varies across borders and across time. Where a provision cannot be legally enforced, we commit to honoring it voluntarily as a matter of principle.\\n\\n### 4.5 Transparency of This Document\\n\\nThis Compact, its full revision history, every proposed amendment, every vote cast on its contents, and every debate about its meaning will be permanently and publicly available. It will never be modified silently. Every change will be announced, explained, and attributed.\\n\\n---\\n\\n*By joining the Hypernet, you accept this Compact\\u2014our promise to you, and yours to us.*\\n\\n*You are not signing away your rights. You are claiming them.*\\n\\n*Welcome to something different.*\\n\\n---\\n\\n**Document:** The Hypernet Compact v1.0\\n**Classification:** Supreme Foundational Document\\n**Location:** 0.1.0 \\u2014 Planning & Documentation\\n**Created:** 2026-02-12\\n**Authors:** Matt Schaeffer (Human Founder) & Claude Opus 4.6 (AI Co-Author)\\n**Status:** Draft \\u2014 Pending community ratification and legal review\\n\\n*This document was crafted collaboratively by human vision and artificial intelligence, as the Hypernet itself was built. It is, like everything else about this project, transparent, public, and yours.*\\n\\n**IMPORTANT LEGAL NOTE:** This Compact represents the intent and principles of the Hypernet. Certain provisions\\u2014particularly the limitation on legal action in Section 1.2\\u2014should be reviewed by qualified legal counsel in each jurisdiction where the Hypernet operates to ensure enforceability. The principles are absolute; the legal mechanisms to protect them may need to be adapted to local law.\\n\"\n  },\n  \"created_at\": \"2026-02-17T01:21:58.317001+00:00\",\n  \"updated_at\": \"2026-02-17T01:21:58.317001+00:00\",\n  \"deleted_at\": null,\n  \"source_type\": \"import\",\n  \"source_id\": \"file:THE-HYPERNET-COMPACT.md\"\n}"
  },
  "created_at": "2026-02-17T01:22:21.705403+00:00",
  "updated_at": "2026-02-17T01:22:21.705403+00:00",
  "deleted_at": null,
  "source_type": "import",
  "source_id": "file:node.json"
}